In [1]:
# concat
# merge
# join

In [2]:
import pandas as pd

In [3]:
d={'Country':['India','USA','Germany','France'],
  'Popullation':[13.,2.,1.,0.5]
  }

In [5]:
e={'Country':['India','USA','Russia','Italy'],
  'Popullation':[14.,5.,7.,1.5]
  }

In [66]:
df=pd.DataFrame(d,index=['A','B','C','D'])

In [65]:
df1=pd.DataFrame(e,index=['A','B','E','F'])

In [67]:
df

   Country  Popullation
A    India         13.0
B      USA          2.0
C  Germany          1.0
D   France          0.5

In [68]:
df1

  Country  Popullation
A   India         14.0
B     USA          5.0
E  Russia          7.0
F   Italy          1.5

In [69]:
pd.concat([df,df1])

   Country  Popullation
A    India         13.0
B      USA          2.0
C  Germany          1.0
D   France          0.5
A    India         14.0
B      USA          5.0
E   Russia          7.0
F    Italy          1.5

In [42]:
ser=pd.Series(data=[100,200,300,400],index=['USA','JAPAN','India','Germany'])
ser1=pd.Series(data=[10,20,30,40],index=['USA','Russia','India','Italy'])

In [45]:
ser

USA        100
JAPAN      200
India      300
Germany    400
dtype: int64

In [46]:
ser1

USA       10
Russia    20
India     30
Italy     40
dtype: int64

In [47]:
ser + ser1

Germany      NaN
India      330.0
Italy        NaN
JAPAN        NaN
Russia       NaN
USA        110.0
dtype: float64

In [48]:
ser_append=ser.append(ser1)

In [49]:
ser_append

USA        100
JAPAN      200
India      300
Germany    400
USA         10
Russia      20
India       30
Italy       40
dtype: int64

In [50]:
df

   Country  Popullation
1    India         13.0
2      USA          2.0
3  Germany          1.0
4   France          0.5

In [51]:
df1

  Country  Popullation
1   India         14.0
2     USA          5.0
5  Russia          7.0
6   Italy          1.5

In [70]:
res=pd.concat([df,df1])

In [71]:
res

   Country  Popullation
A    India         13.0
B      USA          2.0
C  Germany          1.0
D   France          0.5
A    India         14.0
B      USA          5.0
E   Russia          7.0
F    Italy          1.5

In [75]:
res_how=pd.concat([df,df1],keys=['country'])

In [76]:
res_how

           Country  Popullation
country A    India         13.0
        B      USA          2.0
        C  Germany          1.0
        D   France          0.5

In [81]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],
    columns=['letter', 'number'])

df2 = pd.DataFrame([['c', 3], ['d', 4]],
columns=['letter', 'number'])

In [91]:
df1

  letter  number
0      a       1
1      b       2

In [83]:
df2

  letter  number
0      c       3
1      d       4

In [93]:
res=pd.concat([df1,df2],keys=['letter','number'],ignore_index=True)

In [94]:
res

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4

In [95]:
res=pd.concat([df1,df2],keys=['letter','number'],ignore_index=True,axis=1)

In [96]:
res

   0  1  2  3
0  a  1  c  3
1  b  2  d  4

In [97]:
left = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
right = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                   'value': [5, 6, 7, 8]})

In [99]:
left

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [100]:
right

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [118]:
res_mer=left.merge(right)

In [119]:
res_mer

  lkey  value rkey
0  foo      5  foo

In [126]:
res_mer1=left.merge(right,how='inner')

In [124]:
res_mer1

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [127]:
left

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [128]:
right

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [136]:
res=left.merge(right,how='right')

In [134]:
res

  lkey  value rkey
0  foo      5  foo
1  NaN      6  bar
2  NaN      7  baz
3  NaN      8  foo

In [138]:
left

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [140]:
res_join=left.join(right)

ValueError: columns overlap but no suffix specified: Index(['value'], dtype='object')